mcci-catena/Arduino_Core_STM32/boards.txt
# convert boot selections to settings
mcci_catena_4610.menu.boot.basic.build.ldscript=../mcci-ldscript-basic.ld
mcci_catena_4610.menu.boot.basic.build.baseaddr=0x08000000
mcci_catena_4610.menu.boot.trusted.build.ldscript=../mcci-ldscript-trusted.ld
mcci_catena_4610.menu.boot.trusted.build.baseaddr=0x08005000

#
# menu.opt
mcci_catena_4610.menu.opt.osstd=Smallest (-Os default)
mcci_catena_4610.menu.opt.osstd.build.flags.optimize=-Os
mcci_catena_4610.menu.opt.osstd.build.flags.ldspecs=
# mcci_catena_4610.menu.opt.oslto=Smallest (-Os) with LTO
# mcci_catena_4610.menu.opt.oslto.build.flags.optimize=-Os -flto
# mcci_catena_4610.menu.opt.oslto.build.flags.ldspecs=-flto
mcci_catena_4610.menu.opt.o1std=Fast (-O1)
mcci_catena_4610.menu.opt.o1std.build.flags.optimize=-O1
mcci_catena_4610.menu.opt.o1std.build.flags.ldspecs=
# mcci_catena_4610.menu.opt.o1lto=Fast (-O1) with LTO
# mcci_catena_4610.menu.opt.o1lto.build.flags.optimize=-O1 -flto
# mcci_catena_4610.menu.opt.o1lto.build.flags.ldspecs=-flto
mcci_catena_4610.menu.opt.o2std=Faster (-O2)
mcci_catena_4610.menu.opt.o2std.build.flags.optimize=-O2
mcci_catena_4610.menu.opt.o2std.build.flags.ldspecs=
# mcci_catena_4610.menu.opt.o2lto=Faster (-O2) with LTO
# mcci_catena_4610.menu.opt.o2lto.build.flags.optimize=-O2 -flto
# mcci_catena_4610.menu.opt.o2lto.build.flags.ldspecs=-flto
mcci_catena_4610.menu.opt.o3std=Fastest (-O3)
mcci_catena_4610.menu.opt.o3std.build.flags.optimize=-O3
mcci_catena_4610.menu.opt.o3std.build.flags.ldspecs=
# mcci_catena_4610.menu.opt.o3lto=Fastest (-O3) with LTO
# mcci_catena_4610.menu.opt.o3lto.build.flags.optimize=-O3 -flto
# mcci_catena_4610.menu.opt.o3lto.build.flags.ldspecs=-flto
mcci_catena_4610.menu.opt.ogstd=Debug (-g)
mcci_catena_4610.menu.opt.ogstd.build.flags.optimize=-Og -gdwarf-2
mcci_catena_4610.menu.opt.ogstd.build.flags.ldspecs=

#
# menu.lorawan_region
mcci_catena_4610.menu.lorawan_region.us915=North America 915 MHz
mcci_catena_4610.menu.lorawan_region.eu868=Europe 868 MHz
mcci_catena_4610.menu.lorawan_region.au915=Australia 915 MHz
mcci_catena_4610.menu.lorawan_region.as923=Asia 923 MHz
mcci_catena_4610.menu.lorawan_region.as923jp=Japan 923 MHz
mcci_catena_4610.menu.lorawan_region.kr920=Korea 920 MHz
mcci_catena_4610.menu.lorawan_region.in866=India 866 MHz
mcci_catena_4610.menu.lorawan_region.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.us915.build.lorawan_flags=-DCFG_us915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.eu868.build.lorawan_flags=-DCFG_eu868=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.au915.build.lorawan_flags=-DCFG_au921=1 -DCFG_au915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.as923.build.lorawan_flags=-DCFG_as923=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.as923jp.build.lorawan_flags=-DCFG_as923=1 -DLMIC_COUNTRY_CODE=LMIC_COUNTRY_CODE_JP -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.kr920.build.lorawan_flags=-DCFG_kr920=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.in866.build.lorawan_flags=-DCFG_in866=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_region.projcfg.build.lorawan_flags=

#
# menu.lorawan_network
mcci_catena_4610.menu.lorawan_network.ttn=The Things Network
mcci_catena_4610.menu.lorawan_network.ttn.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_TTN=1
mcci_catena_4610.menu.lorawan_network.actility=Actility ThingsPark
mcci_catena_4610.menu.lorawan_network.actility.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_ACTILITY=1
mcci_catena_4610.menu.lorawan_network.helium=Helium
mcci_catena_4610.menu.lorawan_network.helium.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_HELIUM=1
mcci_catena_4610.menu.lorawan_network.machineq=machineQ
mcci_catena_4610.menu.lorawan_network.machineq.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_MACHINEQ=1
mcci_catena_4610.menu.lorawan_network.senet=Senet
mcci_catena_4610.menu.lorawan_network.senet.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENET=1
mcci_catena_4610.menu.lorawan_network.senra=Senra
mcci_catena_4610.menu.lorawan_network.senra.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENRA=1
mcci_catena_4610.menu.lorawan_network.swisscom=Swisscom
mcci_catena_4610.menu.lorawan_network.swisscom.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SWISSCOM=1
mcci_catena_4610.menu.lorawan_network.chirpstack=ChirpStack
mcci_catena_4610.menu.lorawan_network.chirpstack.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_CHIRPSTACK=1
mcci_catena_4610.menu.lorawan_network.generic=Generic
mcci_catena_4610.menu.lorawan_network.generic.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_GENERIC=1
mcci_catena_4610.menu.lorawan_network.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4610.menu.lorawan_network.projcfg.build.lorawan_network_flags=

#
# menul.lorawan_subband
mcci_catena_4610.menu.lorawan_subband.default=Default, works everywhere
mcci_catena_4610.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_catena_4610.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_catena_4610.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_catena_4610.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_catena_4610.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_catena_4610.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_catena_4610.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_catena_4610.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_catena_4610.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_catena_4610.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_catena_4610.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_catena_4610.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_catena_4610.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_catena_4610.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_catena_4610.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_catena_4610.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_catena_4610.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_catena_4610.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

#### end of configuration info for MCCI Catena 4610

#
# Configuration information for MCCI Catena 4611
# See template in https://github.com/mcci-catena/Arduino_Core_STM32/boards.template
#
mcci_catena_4611.name=MCCI Catena 4611
mcci_catena_4611.build.vid=0x040E
mcci_catena_4611.build.pid=0x0081
mcci_catena_4611.vid.0=0x040E
mcci_catena_4611.pid.0=0x0081
mcci_catena_4611.build.usb_product="MCCI Catena 4611"
mcci_catena_4611.build.usb_manufacturer="MCCI Corporation"

