mcci-catena/Arduino_Core_STM32/boards.txt
#
# menul.lorawan_subband
mcci_model_4917.menu.lorawan_subband.default=Default, works everywhere
mcci_model_4917.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_model_4917.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_model_4917.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_model_4917.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_model_4917.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_model_4917.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_model_4917.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_model_4917.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_model_4917.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_model_4917.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_model_4917.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_model_4917.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_model_4917.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_model_4917.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_model_4917.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_model_4917.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_model_4917.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

#### end of configuration info for MCCI Model 4917

